1c-client/src/Enums/AIG_ТипыСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>AIG_ТипыСообщений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>User</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>System</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Assistant</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Tool</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Other</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1c-client/src/Catalogs/AIG_Чаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>AIG_Чаты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Успешно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧатID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сообщения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаСоздания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипСообщения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.AIG_ТипыСообщений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сообщение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1c-client/src/CommonModules/AIG_APIСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ОтправитьСообщение(ТекстСообщения, Чат) Экспорт
	
	НастройкиПодключения = ПолучитьНастройки();
	
	МассивКонтекст = Новый Массив;
	
	Если НастройкиПодключения.ПередаватьКонтекстЧата Тогда
		
		ТипыСообщенийИсключения = Новый Массив;
		ТипыСообщенийИсключения.Добавить(Перечисления.AIG_ТипыСообщений.System); 	//всегда один
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 10
		|	AIG_ЧатыСообщения.ТипСообщения КАК ТипСообщения,
		|	AIG_ЧатыСообщения.Сообщение КАК Сообщение
		|ИЗ
		|	Справочник.AIG_Чаты.Сообщения КАК AIG_ЧатыСообщения
		|ГДЕ
		|	AIG_ЧатыСообщения.Ссылка = &Ссылка
		|	И НЕ AIG_ЧатыСообщения.ТипСообщения В (&ТипСообщения)
		|
		|УПОРЯДОЧИТЬ ПО
		|	AIG_ЧатыСообщения.НомерСтроки УБЫВ";
		
		Запрос.УстановитьПараметр("Ссылка", Чат);
		Запрос.УстановитьПараметр("ТипСообщения", ТипыСообщенийИсключения);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда 
			
			МетаданныеПеречисления = Метаданные.Перечисления.AIG_ТипыСообщений;

			ТаблицаКонтекст = РезультатЗапроса.Выгрузить();
			Индекс = ТаблицаКонтекст.Количество() - 1;
			Пока Индекс >= 0 Цикл
				
				ДанныеКонтекста = ТаблицаКонтекст[Индекс];

				role = МетаданныеПеречисления.ЗначенияПеречисления.Найти(ДанныеКонтекста.ТипСообщения).Имя;
				
				СтруктураКонтектса = Новый Структура;
				СтруктураКонтектса.Вставить("role", 	НРег(role));
				
				Если ДанныеКонтекста.ТипСообщения = Перечисления.AIG_ТипыСообщений.Tool Тогда
					
					Если Не Индекс = ТаблицаКонтекст.Количество() - 1 Тогда
					
						ДанныеВызова = ТаблицаКонтекст[Индекс+1];
						МассивСтруктураДанныхВызова = AIG_ОбщегоНазначения.JSONВСтруктуру(ДанныеВызова.Сообщение);
						Если ТипЗнч(МассивСтруктураДанныхВызова) = Тип("Массив") Тогда
							СтруктураКонтектса.Вставить("tool_call_id", МассивСтруктураДанныхВызова[0].id);
						Иначе
							Индекс = Индекс - 1;
							Продолжить;//нельзя передавать Tool без tool_call_id
						КонецЕсли;
					Иначе
						Индекс = Индекс - 1;
						Продолжить;//нельзя передавать Tool без tool_call_id
					КонецЕсли;
				КонецЕсли;
				
				СтруктураКонтектса.Вставить("content", 	ДанныеКонтекста.Сообщение);
				МассивКонтекст.Добавить(СтруктураКонтектса);
				
				Индекс = Индекс - 1;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
    Результат = ОтправитьСообщениеПоAPI(НастройкиПодключения, ТекстСообщения, МассивКонтекст);
	
	Если Не Результат.Успешно Тогда
	
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = Результат.ТекстОшибки;
		Сообщение.Сообщить();
		
		Возврат Ложь;
	КонецЕсли;
	
	ЧатОбъект = Чат.ПолучитьОбъект();
	
	Результат_Контекст = Результат.Контекст;
	Ответ = "";
	ЧатID = "";
	Если ТипЗнч(Результат_Контекст) = Тип("Структура") Тогда
		
		Если Результат_Контекст.Свойство("result") Тогда
			
			Ответ = Результат_Контекст.result.content;
			ЧатID = Результат_Контекст.result.id;
			
			Для Каждого message Из Результат_Контекст.result.messages Цикл
				
				role 			= message.role;
				messagecontent 	= message.content;
				
				Попытка
					ТипСообщения = Перечисления.AIG_ТипыСообщений[role];
				Исключение
					ТипСообщения = Перечисления.AIG_ТипыСообщений.Other;
				КонецПопытки;
				
				Если ТипСообщения = Перечисления.AIG_ТипыСообщений.Assistant 
					И message.Свойство("tool_calls")
					И ЗначениеЗаполнено(message.tool_calls) Тогда
					
					messagecontent = AIG_ОбщегоНазначения.ФорматироватьСтрокуJSON(AIG_ОбщегоНазначения.ДанныеВJSON(message.tool_calls));
				ИначеЕсли ТипСообщения = Перечисления.AIG_ТипыСообщений.Tool Тогда
					
					messagecontent = AIG_ОбщегоНазначения.ФорматироватьСтрокуJSON(messagecontent);
				КонецЕсли;					
					
				НовоеСообщение = ЧатОбъект.Сообщения.Добавить();
				НовоеСообщение.ДатаСоздания = ТекущаяДатаСеанса();
				НовоеСообщение.Сообщение 	= messagecontent;
				НовоеСообщение.ТипСообщения = ТипСообщения;
			КонецЦикла;			
			
			НовоеСообщение = ЧатОбъект.Сообщения.Добавить();
			НовоеСообщение.ДатаСоздания = ТекущаяДатаСеанса();
			НовоеСообщение.Сообщение = Ответ;
			НовоеСообщение.ТипСообщения = Перечисления.AIG_ТипыСообщений.Assistant;
		КонецЕсли;
	КонецЕсли;
	
	ЧатОбъект.Ответ = Ответ;
	ЧатОбъект.ЧатID = ЧатID;
	ЧатОбъект.Успешно = Истина;
	
	ЧатОбъект.Записать();
	
	Возврат Истина;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьНастройки()
	
	АдресСервераGatewayAPI = Константы.AIG_АдресСервераGatewayAPI.Получить();
	Если АдресСервераGatewayAPI = "" Тогда
		
		АдресСервераGatewayAPI = "localhost";
	КонецЕсли;
	
	ОсновнаяМодель = Константы.AIG_ОсновнаяМодель.Получить();
	ОсновнаяМодельСтр = Неопределено;
	Если ЗначениеЗаполнено(ОсновнаяМодель) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	AIG_Модели.Наименование КАК Наименование,
		|	AIG_Модели.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
		|ИЗ
		|	Справочник.AIG_Модели КАК AIG_Модели
		|ГДЕ
		|	AIG_Модели.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ОсновнаяМодель);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			ВыборкаДетальныеЗаписи.Следующий();
			
			ОсновнаяМодельСтр = ВыборкаДетальныеЗаписи.Наименование;
		КонецЕсли;
	КонецЕсли;
	
	СистемнаяРоль	= Константы.AIG_СистемнаяРоль.Получить();
	Если Не ЗначениеЗаполнено(СистемнаяРоль) Тогда
		
		СистемнаяРоль = Справочники.AIG_Модели.ПолучитьМакет("system_role").ПолучитьТекст();
	КонецЕсли;
	
	ПередаватьКонтекстЧата = Константы.AIG_ПередаватьКонтекстЧата.Получить();
	
	СтруктураНастроек = СтруктураНастроек();
	СтруктураНастроек.Сервер 		= АдресСервераGatewayAPI;
	СтруктураНастроек.Модель 		= ОсновнаяМодельСтр;
	СтруктураНастроек.СистемнаяРоль = СистемнаяРоль;
	СтруктураНастроек.ПередаватьКонтекстЧата = ПередаватьКонтекстЧата;	

	Возврат СтруктураНастроек;

КонецФункции 

Функция СтруктураНастроек()

	Структура = Новый Структура;
	Структура.Вставить("Сервер", "");
	Структура.Вставить("Порт", 8000);
	Структура.Вставить("Пользователь", "");
	Структура.Вставить("Пароль", "");
	Структура.Вставить("Модель", 		Неопределено);
	Структура.Вставить("СистемнаяРоль", "");
    Структура.Вставить("ПередаватьКонтекстЧата", Ложь);
	
	Возврат Структура
	
КонецФункции 

Функция ОтправитьСообщениеПоAPI(Настройки, ТекстСообщения, КонтекстСообщений)
	
	Результат = Новый Структура("Успешно, Контекст, ТекстОшибки", 
		Истина, "", "");
	
	Соединение = Новый HTTPСоединение(Настройки.Сервер, Настройки.Порт,,,, 30);

    Запрос = Новый HTTPЗапрос("/chat");
	Запрос.Заголовки.Вставить("Content-Type", "application/json");
	
	Тело = Новый Структура;
    Тело.Вставить("message", 		ТекстСообщения); 
	Тело.Вставить("model", 			Настройки.Модель); 
	Тело.Вставить("system_role", 	Настройки.СистемнаяРоль); 
	Тело.Вставить("message_content", КонтекстСообщений); 
	
	//передача всех сообщений

   	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Тело);
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Запрос.УстановитьТелоИзСтроки(СтрокаJSON, "UTF-8");

    Ответ = Соединение.ОтправитьДляОбработки(Запрос);
       
    Если Ответ.КодСостояния <> 200 Тогда
		
		СтрокаОтвета = Ответ.ПолучитьТелоКакСтроку();
		
		Результат.Успешно = Ложь;
		Результат.ТекстОшибки = "HTTP ошибка: " + Ответ.КодСостояния + " " + СтрокаОтвета;
		
    	Возврат Результат;
    КонецЕсли;

    СтрокаОтвета = Ответ.ПолучитьТелоКакСтроку();

    Чтение = Новый ЧтениеJSON;
    Чтение.УстановитьСтроку(СтрокаОтвета);

    Результат.Контекст = ПрочитатьJSON(Чтение);
	
	Возврат Результат;

КонецФункции

#КонецОбласти
